---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendShowConfigName
source: html/b857c1bd-c9f5-3be5-6b6d-7ac86c4aa9c4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendShowConfigName Property

"Show Configuration Name"

## Syntax (C#)
```csharp
public static ForgeTypeId SpatialFieldMgrLegendShowConfigName { get; }
```